<template>
  <div>
    <h1>绑定可播放音频操作:</h1>
    <p>...</p>
    <br/>
    <p>1. complex歌曲为绑定了特定音频的歌曲, 歌曲除了音频的其它信息来自于qq或netease. 这取决于你当时绑定的操作流程</p>
    <p>2. 批量绑定页面,是分段加载的, 因为一次性加载过多会被b站检测,进而将ip拉入黑名单. 如果进了黑名单几个小时就会恢复白名单</p>
    <p>3. 绑定功能一共提供了3种方式: </p>
    <p>  3.1 搜索页面搜到歌曲后, 点击歌曲上的搜索按钮. 此时可以输入视频bvid, 会返回搜索到的视频. 此时点击视频即可试听绑定效果. 之后再加入任意歌单就可以记录下这首歌的绑定音频. 之后可以从歌单将这首歌移除, 绑定结果不会擦除</p>
    <p>  3.2 和3.1类似. 只是此时不提供bvid, 采用自动搜索视频. 凡是<strong>此次</strong>自动搜索搜索到的音频也可以试听绑定, 再加入任意歌单即可记录下绑定结果. <strong>注意</strong>只有点击本次自动搜索的视频才能有绑定效果;
        如果想要绑定某一次手动搜索的视频, 可以点击视频播放. 在视频singer中显示视频bvid. 再通过3.1方式指定绑定即可</p>
    <p>  3.3 批量绑定</p>
  </div>
</template>

<script>

export default {
  name: 'About',
  components: {},
  data() {
    return {}
  }
}
</script>
